{"class_name": "Sequential", "keras_version": "2.1.4", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_1", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "batch_input_shape": [null, 150, 150, 3], "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_2", "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2", "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_3", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_3", "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_4", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_4", "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "units": 100, "use_bias": true, "activation": "linear", "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_5", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 4, "use_bias": true, "activation": "linear", "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_5"}}]}