{"keras_version": "2.1.4", "config": [{"config": {"kernel_constraint": null, "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_1", "kernel_regularizer": null, "padding": "same", "dtype": "float32", "filters": 32, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "padding": "valid", "filters": 32, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_3", "kernel_regularizer": null, "padding": "valid", "filters": 64, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "conv2d_4", "kernel_regularizer": null, "padding": "valid", "filters": 64, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 100, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "trainable": true, "noise_shape": null, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 4, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}